In [2]:
# Data Frames - 2D

In [3]:
import pandas as pd

In [4]:
# list

In [5]:
df= pd.DataFrame([12,34,56,78])

In [6]:
df

    0
0  12
1  34
2  56
3  78

In [8]:
df.shape  # (rows, columns)

(4, 1)

In [9]:
df1=pd.DataFrame([[12,13,14],[45,67,89]])
df1

    0   1   2
0  12  13  14
1  45  67  89

In [10]:
df1.shape

(2, 3)

In [11]:
#dictionary

In [17]:
df= pd.DataFrame({'Name':['Gurminder'],'class':['btech'],'rollno':[12]})
df

        Name  class  rollno
0  Gurminder  btech      12

In [20]:
df= pd.DataFrame({'Name':['Gurminder','Gagan','Simran','Muskan'],'class':['btech','BCA','MCA','MBA'],'rollno':[12,14,15,17]})
df

        Name  class  rollno
0  Gurminder  btech      12
1      Gagan    BCA      14
2     Simran    MCA      15
3     Muskan    MBA      17

In [21]:
df.shape

(4, 3)

In [22]:
#access elements

In [29]:
df[1:3]

     Name class  rollno
1   Gagan   BCA      14
2  Simran   MCA      15

In [30]:
df.Name

0    Gurminder
1        Gagan
2       Simran
3       Muskan
Name: Name, dtype: object

In [33]:
df['class']

0    btech
1      BCA
2      MCA
3      MBA
Name: class, dtype: object

In [34]:
# loc and iloc

In [35]:
df.loc[:,:]  # rows, columns

        Name  class  rollno
0  Gurminder  btech      12
1      Gagan    BCA      14
2     Simran    MCA      15
3     Muskan    MBA      17

In [41]:
df.loc[:2,'Name']

0    Gurminder
1        Gagan
2       Simran
Name: Name, dtype: object

In [43]:
df.loc[:2,['Name','class']]

        Name  class
0  Gurminder  btech
1      Gagan    BCA
2     Simran    MCA

In [40]:
df.iloc[:2,:1]

        Name
0  Gurminder
1      Gagan

In [44]:
df

        Name  class  rollno
0  Gurminder  btech      12
1      Gagan    BCA      14
2     Simran    MCA      15
3     Muskan    MBA      17

In [45]:
df.loc[2,'class']

'MCA'

In [46]:
df.loc[1,'rollno']

14

In [47]:
df.at[1,'rollno']

14

In [50]:
df.iat[3,1]

'MBA'

In [51]:
#update

In [52]:
df

        Name  class  rollno
0  Gurminder  btech      12
1      Gagan    BCA      14
2     Simran    MCA      15
3     Muskan    MBA      17

In [53]:
df.loc[3,'class']='btech'

In [54]:
df

        Name  class  rollno
0  Gurminder  btech      12
1      Gagan    BCA      14
2     Simran    MCA      15
3     Muskan  btech      17

In [55]:
df.loc[:,'address']='Mohali'

In [56]:
df

        Name  class  rollno address
0  Gurminder  btech      12  Mohali
1      Gagan    BCA      14  Mohali
2     Simran    MCA      15  Mohali
3     Muskan  btech      17  Mohali

In [57]:
df.loc[:,'temp_address']=['Mohali','92 Sector','91 Sector','Aero City']
df

        Name  class  rollno address temp_address
0  Gurminder  btech      12  Mohali       Mohali
1      Gagan    BCA      14  Mohali    92 Sector
2     Simran    MCA      15  Mohali    91 Sector
3     Muskan  btech      17  Mohali    Aero City

In [59]:
df.loc[:,'address']=['Mohali','Sohana','71 Sec','Chapad chidi']

In [60]:
df

        Name  class  rollno       address temp_address
0  Gurminder  btech      12        Mohali       Mohali
1      Gagan    BCA      14        Sohana    92 Sector
2     Simran    MCA      15        71 Sec    91 Sector
3     Muskan  btech      17  Chapad chidi    Aero City

In [61]:
df.loc[4,:]=12

In [62]:
df

        Name  class  rollno       address temp_address
0  Gurminder  btech    12.0        Mohali       Mohali
1      Gagan    BCA    14.0        Sohana    92 Sector
2     Simran    MCA    15.0        71 Sec    91 Sector
3     Muskan  btech    17.0  Chapad chidi    Aero City
4         12     12    12.0            12           12

In [66]:
df.drop(4,axis=0, inplace=True)

In [67]:
df

        Name  class  rollno       address temp_address
0  Gurminder  btech    12.0        Mohali       Mohali
1      Gagan    BCA    14.0        Sohana    92 Sector
2     Simran    MCA    15.0        71 Sec    91 Sector
3     Muskan  btech    17.0  Chapad chidi    Aero City

In [69]:
df.drop('address',axis=1)

        Name  class  rollno temp_address
0  Gurminder  btech    12.0       Mohali
1      Gagan    BCA    14.0    92 Sector
2     Simran    MCA    15.0    91 Sector
3     Muskan  btech    17.0    Aero City

In [71]:
df.head(2)

        Name  class  rollno address temp_address
0  Gurminder  btech    12.0  Mohali       Mohali
1      Gagan    BCA    14.0  Sohana    92 Sector

In [72]:
df.tail(2)

     Name  class  rollno       address temp_address
2  Simran    MCA    15.0        71 Sec    91 Sector
3  Muskan  btech    17.0  Chapad chidi    Aero City

In [74]:
df

        Name  class  rollno       address temp_address
0  Gurminder  btech    12.0        Mohali       Mohali
1      Gagan    BCA    14.0        Sohana    92 Sector
2     Simran    MCA    15.0        71 Sec    91 Sector
3     Muskan  btech    17.0  Chapad chidi    Aero City

In [73]:
df.info()  # dataframe all information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          4 non-null      object
 1   class         4 non-null      object
 2   rollno        4 non-null      float64
 3   address       4 non-null      object
 4   temp_address  4 non-null      object
dtypes: float64(1), object(4)
memory usage: 292.0+ bytes

In [76]:
df.describe()

          rollno
count   4.000000
mean   14.500000
std     2.081666
min    12.000000
25%    13.500000
50%    14.500000
75%    15.500000
max    17.000000

In [80]:
df2= pd.DataFrame([[1,2,3,4],[3,4,5,6],[3,4,5,6],[7,8,9,10],[1,2,3,4]])
df2

   0  1  2   3
0  1  2  3   4
1  3  4  5   6
2  3  4  5   6
3  7  8  9  10
4  1  2  3   4

In [81]:
df2.drop_duplicates()

   0  1  2   3
0  1  2  3   4
1  3  4  5   6
3  7  8  9  10

In [82]:
df2.drop_duplicates(ignore_index=True)

   0  1  2   3
0  1  2  3   4
1  3  4  5   6
2  7  8  9  10

In [83]:
df2.drop_duplicates(ignore_index=True, inplace=True)

In [84]:
df2

   0  1  2   3
0  1  2  3   4
1  3  4  5   6
2  7  8  9  10